#!/bin/bash

# Задайте список идентификаторов GCF
gcf_ids=("GCF_001306765.1" "GCA_030010415.1" "GCF_018831605.1" "GCF_009617955.1" "GCF_000754225.1" "GCF_024124585.1" "GCF_024124625.1" "GCF_013350055.1" "GCF_016495405.1" "GCF_011319755.1" "GCF_018860945.1" "GCF_018860945.1" "GCF_009931455.1" "GCF_029846385.1" "GCF_029846335.1" "GCF_030010515.1" "GCF_027947415.1" "GCF_002916775.1" "GCF_900119965.1" "GCF_013374055.1" "GCF_005144735.1" "GCF_006540105.1" "GCF_014876835.1" "GCF_013374075.1" "GCF_004006355.1" "GCF_001720485.1" "GCF_009796845.1" "GCF_002213105.1" "GCF_007786215.1" "GCF_000591415.1" "GCF_029846355.1" "GCF_029846435.1" "GCF_029846315.1" "GCF_018340035.1" "GCF_023161745.1" "GCF_029846405.1")

# Создайте директорию для файлов GTF
mkdir -p GTF_files

# Цикл для скачивания и обработки GTF файлов
for id in "${gcf_ids[@]}"; do
  # Скачивание и распаковка файла
  ./datasets download genome accession $id --filename ${id}_dataset.zip --include gtf
  unzip -o ${id}_dataset.zip
  
  # Перемещение и переименование файла GTF
  mv ncbi_dataset/data/${id}/genomic.gtf GTF_files/${id}.gtf
  
  # Очистка временных файлов
  rm -r ncbi_dataset
  
done 

